<?php
// Створіть файл 'test.txt' , запишіть у нього рядок 'Hello Palmo''.
$file1 = fopen('backend/storage/test.txt', 'w');
fwrite($file1, 'Hello Palmo');
fclose($file1);

//  Відобразіть вміст файлу на сторінці
echo "test.txt : " . file_get_contents('backend/storage/test.txt') . "<br>";

//  Відобразіть розмір файлу на сторінці (У байтах, мегабайтах, гігабайтах)
$fileSize = filesize('backend/storage/test.txt');
echo "У байтах : " . $fileSize . "<br>";
echo " мегабайтах : " . round($fileSize / 1024 / 1024, 2) . "<br>";
echo " гігабайтах : " . round($fileSize / 1024 / 1024 / 1024, 2) . "<br>";

// Створіть файл 'test2.txt'
$file2 = fopen('backend/storage/test2.txt', 'w');
fclose($file2);

// Видаліть 'test.2.txt'
unlink('backend/storage/test2.txt');

// Створіть папку TestDir
$testDir = 'backend/storage/TestDir';
if (!is_dir($testDir)) {
    mkdir($testDir, 0777, true);
}

// Дано масив ['test1','test2','test3'], створіть у папці Test папки, назвами яких слугують рядки масиву 
$folders = ['test1', 'test2', 'test3'];

// Створіть у кожній вкладеній у TestDir папці, файл Hello.txt, у кожен із них запишіть рядок "Hello world", виведіть на екран вміст усіх файлів.
foreach ($folders as $folder) {
    $folderPath = $testDir . '/' . $folder;
    if (!is_dir($folderPath)) {
        mkdir($folderPath);
    }
    $file3 = fopen($folderPath . '/Hello.txt', 'w'); 
    if ($file3) {
        fwrite($file3, 'Hello world');
        fclose($file3); 
    } else {
        echo "Не удалось создать файл в папке: $folderPath<br>";
    }
}

foreach ($folders as $folder) {
    $filePath = $testDir . '/' . $folder . '/Hello.txt';
    if (file_exists($filePath)) {
        echo "Содержимое '$filePath': " . file_get_contents($filePath) . "<br>";
    } else {
        echo "Файл '$filePath' не найден.<br>";
    }
}

// Напишіть функцію, яка приймає назву файлу або папки і перевіряє, чи є передане значення файлом або папкою (повернути рядок)
function checkType($path) {
    if (is_dir($path)){
        return "папка";
    } elseif (is_file($path)){
        return "файл";
    } else{
        return "Не найдено";
    }
    };

// Timestamp: time та mktime
// Для вирішення завдань цього блоку вам знадобляться такі функції: time, mktime.
//   Виведіть поточний час у форматі timestamp.

//   Виведіть 1 березня 2025 року у форматі timestamp.

//   Виведіть 31 грудня поточного року у форматі timestamp. Скрипт повинен працювати незалежно від року, коли він запущений.

//   Знайдіть кількість секунд, що пройшли з 13:12:59 15 березня 2000 року до теперішнього часу.

//   Знайдіть кількість годин, що пройшли з 7:23:48 поточного дня до цього часу.

// Функція date
// Для вирішення завдань цього блоку вам знадобляться такі функції: date.
//   Виведіть на екран поточний рік, місяць, день, годину, хвилину, секунду.

//   Виведіть поточну дату-час у форматах '2025-12-31', '31.12.2025', '31.12.13', '12:59:59'.

//   За допомогою функцій mktime та date виведіть 12 лютого 2025 року у форматі '12.02.2025'.

//   Створіть масив днів тижня $week. Виведіть на екран назву поточного дня тижня за допомогою масиву $week та функції date. Дізнайтеся, який день тижня був 06.06.2006, у ваш день народження.

//   Створіть масив місяців $month. Виведіть на екран назву поточного місяця за допомогою масиву $month та функції date.

//   Знайдіть кількість днів у поточному місяці. Скрипт повинен працювати незалежно від місяця, коли він запущений.

//   Зробіть поле введення, в яке користувач вводить рік (4 цифри), а скрипт визначає чи високосний рік.

//   Зробіть форму, яка запитує дату у форматі '31.12.2025'. За допомогою mktime та explode переведіть цю дату у формат timestamp. Дізнайтесь день тижня (словом) за введену дату.

//   Зробіть форму, яка запитує дату у форматі '2025-12-31'. За допомогою mktime та explode переведіть цю дату у формат timestamp. Дізнайтесь місяць (словом) за введену дату.

// Порівняння дат
//   Зробіть форму, яка запитує дві дати у форматі '2025-12-31'. Першу дату запишіть у змінну $date1, а другу в $date2. Порівняйте, яка із введених дат більше. Виведіть її на екран.

// На strtotime
// Для вирішення завдань цього блоку вам знадобляться такі функції: strtotime.
//   Дана дата у форматі '2025-12-31'. За допомогою функції strtotime та date перетворіть її на формат '31-12-2025'.

//   Зробіть форму, яка запитує дату-час у форматі '2025-12-31T12:13:59'. За допомогою функції strtotime та функції date перетворіть її на формат '12:13:59 31.12.2025'.

// Додаток та забирання дат
// Для вирішення завдань цього блоку вам знадобляться такі функції: date_create, date_modify, date_format.
//   У змінній $date лежить дата у форматі '2025-12-31'. Додайте до цієї дати 2 дні, 1 місяць та 3 дні, 1 рік. Заберіть від цієї дати 3 дні.

// Завдання
//   Дізнайтеся, скільки днів залишилося до Нового Року. Скрипт має працювати у будь-якому році.

//   Зробіть форму з одним полем введення, яке користувач вводить рік. Знайдіть усі п'ятниці 13-те цього року. Результат виведіть у вигляді масиву дат.

//   Дізнайтеся, який день тижня був 100 днів тому.
?>